[
    "The original 'Back to the Future' time machine was a refrigerator.",
    "Tom Hanks turned down the role of Jerry Maguire.",
    "The sound of a T-Rex in 'Jurassic Park' was made using elephant sounds.",
    "Heath Ledger directed the Joker's homemade videos in 'The Dark Knight'.",
    "Pixar's 'Toy Story' was the first fully computer-animated feature film.",
    "Bruce Willis was almost cast as Sam in 'Ghost'.",
    "Robin Williams was considered for Hagrid in 'Harry Potter'.",
    "In 'Pulp Fiction', all the clocks are set to 4:20.",
    "The DeLorean was chosen in 'Back to the Future' over a fridge to avoid safety concerns.",
    "The language spoken by the Minions in 'Despicable Me' is called 'Minionese'.",
    "The Joker’s tongue flicking in 'The Dark Knight' was an improvisation by Heath Ledger.",
    "Darth Vader has only 12 minutes of screen time in 'A New Hope'.",
    "The scream used in many movies, the 'Wilhelm scream,' dates back to 1951.",
    "Gollum’s voice in 'The Lord of the Rings' was inspired by a cat coughing up a hairball.",
    "The first movie to show a toilet flushing was 'Psycho' (1960).",
    "Morgan Freeman got his first major movie role at 50.",
    "The velociraptor sounds in 'Jurassic Park' were made using tortoises mating.",
    "Leonardo DiCaprio had to eat raw bison liver for 'The Revenant'.",
    "The iconic 'Darth Vader' breathing sound was made using a scuba mask.",
    "Harrison Ford was a carpenter before landing his role in 'Star Wars'.",
    "The code in 'The Matrix' is actually sushi recipes.",
    "Jack Nicholson’s contract for 'Batman' (1989) earned him over $50 million.",
    "The snow in 'The Wizard of Oz' was asbestos.",
    "Daniel Radcliffe broke about 80 wands while filming 'Harry Potter'.",
    "The 'Inception' hallway fight scene was filmed using a real rotating set.",
]

# Define a list of prefixes and suffixes to generate variations.
prefixes = [
    "Surprisingly,", 
    "Remarkably,", 
    "Interestingly,", 
    "Incredibly,", 
    "Notably,", 
    "Curiously,", 
    "Amazingly,"
]
suffixes = [
    "", 
    "This is a fun fact.", 
    "Did you know?", 
    "Truly remarkable!", 
    "It's amazing!", 
    "Worth noting.", 
    "Fascinating, isn't it?"
]
